Revit 2026 API

# RibbonItemEventArgs Properties

---

The RibbonItemEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Application | The current UIApplication. |

#### Reference

RibbonItemEventArgs Class

Autodesk.Revit.UI.Events Namespace